       IDENTIFICATION DIVISION.
       PROGRAM-ID.     GITPGM.
   
       PROCEDURE DIVISION.
           DISPLAY "This is my Git pgm stored in LocalRepositories".
           STOP RUN.